 
 gcc -g p3original.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x84b: file p3original.c, line 31.
(gdb) r
Starting program: /home/runner/ppa-IA2-practice2-4/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p3original.c:31
31    int num = input_number();
(gdb) n
Enter the number:
8
32    int res = is_composite(num);
(gdb) n
33    output(num, res);
(gdb) n
8 is a composite number
34    return 0;
(gdb) s
35  }(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 402) exited normally]
(gdb) l
30  {
31    int num = input_number();
32    int res = is_composite(num);
33    output(num, res);
34    return 0;
35  }(gdb)
