 
 gcc -g p6original.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x85c: file p6original.c, line 29.
(gdb) r
Starting program: /home/runner/ppa-IA2-practice2-4/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p6original.c:29
29  {
(gdb) n
31    input_string(str);
(gdb) n
Enter the string:
hello
33    str_reverse(str, rev_str);
(gdb) n
34    output(str, rev_str);
(gdb) n
The reverse of hello is olleh
35    return 0;
(gdb) s
36  }
(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 752) exited normally]
(gdb) l
31    input_string(str);
32    char rev_str[10];
33    str_reverse(str, rev_str);
34    output(str, rev_str);
35    return 0;
36  }
37
(gdb)
