 
 gcc -g p8original.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0xaf9: file p8original.c, line 71.
(gdb) r
Starting program: /home/runner/ppa-IA2-practice2-4/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p8original.c:71
71  {
(gdb) n
72    int count = input_n();
(gdb) n
How many triangles will you enter:
2
73    Triangle tris[count];
(gdb) n
74    input_n_triangles(count, tris);
(gdb) n
Enter the base, altitude of a triangle:
2
3
Enter the base, altitude of a triangle:
4
6
75    find_areas(count, tris);
(gdb) n
76    Triangle small = find_smallest_triangle(count, tris);
(gdb) n
77    output(count, tris, small);
(gdb) n
2.000000, 3.000000 and
4.000000, 6.000000
is
triangle with base = 2.000000 and altitude = 3.000000 having area = 3.000000
78    return 0;
(gdb) s
79  }(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 1006) exited normally]
(gdb) l
74    input_n_triangles(count, tris);
75    find_areas(count, tris);
76    Triangle small = find_smallest_triangle(count, tris);
77    output(count, tris, small);
78    return 0;
79  }(gdb) 
